import openpyxl

# Словарь символов
char_map = char_map1 = {
    "a": "G", "b": "т", "c": "Ю", "d": "@", "e": "B", "f": "ы", "g": "|", "h": "W",
    "i": "д", "j": "+", "k": ";", "l": "^", "m": "Щ", "n": "\\", "o": "А", "p": "z",
    "q": "K", "r": "5", "s": "Ц", "t": "y", "u": "е", "v": "ш", "w": "&", "x": "Ы",
    "y": "Е", "z": "'", "A": "н", "B": "v", "C": "(", "D": "О", "E": "-", "F": "p",
    "G": "J", "H": "Б", "I": "*", "J": "С", "K": "h", "L": "Ф", "M": "%", "N": "r",
    "O": ",", "P": "Х", "Q": "ф", "R": "Ж", "S": "о", "T": "р", "U": "T", "V": "В",
    "W": "Ъ", "X": ")", "Y": "и", "Z": "b", "0": "ё", "1": ":", "2": "M", "3": "с",
    "4": ">", "5": "q", "6": "<", "7": " ", "8": "!", "9": "ъ", "а": "Я", "б": "x",
    "в": "6", "г": "в", "д": "a", "е": "э", "ё": "л", "ж": "e", "з": "C", "и": ".",
    "й": "з", "к": "t", "л": "к", "м": "Д", "н": "у", "о": "#", "п": "w", "р": "]",
    "с": "X", "т": "З", "у": "п", "ф": "й", "х": "A", "ц": "Й", "ч": "/", "ш": "9",
    "щ": "Ё", "ъ": "Н", "ы": "k", "ь": "4", "э": "Л", "ю": "1", "я": "Р", "А": "l",
    "Б": "3", "В": "Z", "Г": "?", "Д": "П", "Е": "Ш", "Ё": "Т", "Ж": "К", "З": "o",
    "И": "L", "Й": "а", "К": "8", "Л": "f", "М": "g", "Н": "Q", "О": "М", "П": "{",
    "Р": "м", "С": "u", "Т": "R", "У": "У", "Ф": "щ", "Х": "7", "Ц": "U", "Ч": "}",
    "Ш": "Г", "Щ": "d", "Ъ": "Y", "Ы": "[", "Ь": "И", "Э": "ю", "Ю": "Ь", "Я": "=",
    " ": "E", "!": "V", "\"": "ж", "#": "i", "$": "", "%": "\"", "&": "б", "'": "$",
    "(": "j", ")": "Ч", "*": "P", "+": "n", ",": "S", "-": "O", ".": "2", "/": "ц",
    ":": "c", ";": "0", "<": "F", "=": "ь", ">": "s", "?": "я", "@": "~", "[": "N",
    "\\": "D", "]": "m", "^": "_", "_": "ч", "`": "г", "{": "H", "|": "х", "}": "Э",
    "~": "I"
}

# Создаем новый рабочий лист
wb = openpyxl.Workbook()
ws = wb.active

# Размеры таблицы
rows, cols = 17, 10

# Переменная для отслеживания текущего положения в словаре
counter = 0
keys = list(char_map.keys())

# Заполнение таблицы
for i in range(1, rows + 1):
    for j in range(1, cols + 1):
        if counter < len(keys):
            key = keys[counter]
            value = char_map[key]
            cell_value = f'"{key}": "{value}"'
            ws.cell(row=i, column=j, value=cell_value)
            counter += 1

# Сохранение в файл
wb.save("output.xlsx")









